In [5]:
import pandas as pd
print('panda head')
data = {'Name': ['John', 'Alice', 'Bob', 'Emma', 'Mike', 'Sarah', 'David', 'Linda', 'Tom', 'Emily'],
        'Age': [25, 30, 35, 28, 32, 27, 40, 33, 29, 31],
        'City': ['New York', 'Paris', 'London', 'Sydney', 'Tokyo', 'Berlin', 'Rome', 'Madrid', 'Toronto', 'Moscow']}
a=pd.DataFrame(data)
print(a)
r1=a.head(3)
print('first 3 row',r1)
r2=a.head()
print('default row',r2)#first 5 row

panda head
    Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   35    London
3   Emma   28    Sydney
4   Mike   32     Tokyo
5  Sarah   27    Berlin
6  David   40      Rome
7  Linda   33    Madrid
8    Tom   29   Toronto
9  Emily   31    Moscow
first 3 row     Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   35    London
default row     Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   35    London
3   Emma   28    Sydney
4   Mike   32     Tokyo

In [7]:
print('panda tail')
r3=a.tail(3)
print('last 3 row',r3)
r4=a.tail()
print('default row',r4)#last 5 row

panda tail
last 3 row     Name  Age     City
7  Linda   33   Madrid
8    Tom   29  Toronto
9  Emily   31   Moscow
default row     Name  Age     City
5  Sarah   27   Berlin
6  David   40     Rome
7  Linda   33   Madrid
8    Tom   29  Toronto
9  Emily   31   Moscow

In [9]:
'''data frame info gives information about data frame'''
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   City    10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [12]:
''''adding dataframe columns'''
d = {'Name': ['John', 'Emma', 'Michael', 'Sophia'],
        'Height': [5.5, 6.0, 5.8, 5.3],
        'Qualification': ['BSc', 'BBA', 'MBA', 'BSc']}
d1 = pd.DataFrame(d)
'''create new list '''
address=['london', 'paris', 'sydney', 'tokyo']
'''assigned new column'''
d1['Address']=address
print(d1)

      Name  Height Qualification Address
0     John     5.5           BSc  london
1     Emma     6.0           BBA   paris
2  Michael     5.8           MBA  sydney
3   Sophia     5.3           BSc   tokyo

In [27]:
d2=pd.DataFrame(d)
print('original data')
print(d2)
print('no of row')
print(len(d2.index))
d2.loc[len(d2.index)]=['amy',5.2,'BIT']
print('modified data')
'''if yoy know no of row '''
print(d2)
d2.loc[6]=['aj',5.7,'BA']
print(d2)

original data
      Name  Height Qualification
0     John     5.5           BSc
1     Emma     6.0           BBA
2  Michael     5.8           MBA
3   Sophia     5.3           BSc
no of row
4
modified data
      Name  Height Qualification
0     John     5.5           BSc
1     Emma     6.0           BBA
2  Michael     5.8           MBA
3   Sophia     5.3           BSc
4      amy     5.2           BIT
      Name  Height Qualification
0     John     5.5           BSc
1     Emma     6.0           BBA
2  Michael     5.8           MBA
3   Sophia     5.3           BSc
4      amy     5.2           BIT
6       aj     5.7            BA

In [38]:
k = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Felipe', 'Rita'],
        'Age': [25, 30, 35, 40, 22, 29],
        'City': ['New York', 'London', 'Paris', 'Tokyo', 'Bogota', 'Banglore']}
k1= pd.DataFrame(k)
print("Original DataFrame:")
print(k1)
print()

# delete row with index 4
k1.drop(4, axis=0, inplace=True)
print('modified data')
print(k1)
'''another method'''
#  delete row with index 5
k1.drop(index=5, inplace=True)
print('modified data 1')
print(k1)
'''multiple row deleting'''
# delete rows with index 1 and 3
k1.drop([1, 3], axis=0, inplace=True)
print("Modified DataFrame:")
print(k1)
'''False if yoy want to make copy, True will change same data'''
k2=k1.drop(2, axis=0, inplace=False)
print('modified data 2')
print(k2)

Original DataFrame:
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
4   Felipe   22    Bogota
5     Rita   29  Banglore

modified data
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
5     Rita   29  Banglore
modified data 1
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
Modified DataFrame:
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
modified data 2
    Name  Age      City
0  Alice   25  New York
1    Bob   30    London
3  David   40     Tokyo

In [41]:
x = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'London', 'Paris', 'Tokyo'],
        'Height': ['165', '178', '185', '171'],
        'Profession': ['Engineer', 'Entrepreneur', 'Unemployed', 'Actor'],
        'Marital Status': ['Single', 'Married', 'Divorced', 'Engaged']}
x1 = pd.DataFrame(x)
print("Original DataFrame:")
print(x1)
print()

x1.drop('Age', axis=1, inplace=True)

# delete marital status column
x1.drop(columns='Marital Status', inplace=True)
'''multiple column deleting'''
# delete height and profession columns
x1.drop(['Height', 'Profession'], axis=1, inplace=True)

print("Modified DataFrame:")
print(x1)

Original DataFrame:
      Name  Age      City Height    Profession Marital Status
0    Alice   25  New York    165      Engineer         Single
1      Bob   30    London    178  Entrepreneur        Married
2  Charlie   35     Paris    185    Unemployed       Divorced
3    David   40     Tokyo    171         Actor        Engaged

Modified DataFrame:
      Name      City
0    Alice  New York
1      Bob    London
2  Charlie     Paris
3    David     Tokyo

In [44]:
x2=pd.DataFrame(x)
print("Original DataFrame:")
print(x2)
'''renaming single index'''
x2.rename(index={0:7}, inplace=True)
print("Modified DataFrame:")
print(x2)
'''multiple index renaming'''
x2.rename(mapper={1:'nn',2:100}, inplace=True)
print("Modified DataFrame:")
print(x2)

Original DataFrame:
      Name  Age      City Height    Profession Marital Status
0    Alice   25  New York    165      Engineer         Single
1      Bob   30    London    178  Entrepreneur        Married
2  Charlie   35     Paris    185    Unemployed       Divorced
3    David   40     Tokyo    171         Actor        Engaged
Modified DataFrame:
      Name  Age      City Height    Profession Marital Status
7    Alice   25  New York    165      Engineer         Single
1      Bob   30    London    178  Entrepreneur        Married
2  Charlie   35     Paris    185    Unemployed       Divorced
3    David   40     Tokyo    171         Actor        Engaged
Modified DataFrame:
        Name  Age      City Height    Profession Marital Status
7      Alice   25  New York    165      Engineer         Single
nn       Bob   30    London    178  Entrepreneur        Married
100  Charlie   35     Paris    185    Unemployed       Divorced
3      David   40     Tokyo    171         Actor        Engaged